#+TITLE:     .spacemacs user-config.org
#+AUTHOR:    Ian Hocking
#+EMAIL:     ihocking@gmail.com
#+LANGUAGE:  en

#+PROPERTY: header-args :tangle ~/Dropbox/shellShared/publicDotfiles/.spacemacsUserConfig.el

** Capture
For more on capture templates, see [[ https://orgmode.org/manual/Capture-templates.html][the manual page on templates]].

#+CAPTION: My capture settings
#+NAME:    tab:capture
| Capture   | Target         | Notes                                               |
|-----------+----------------+-----------------------------------------------------|
| Moleskine | moleskine.org  | Dated, appended, headed TODO                        |
| Meeting   | moleskine.org  | Dated, appended, headed MEETING                     |
| Research  | research.org   | Dated, appended - intended for notes during reading |
| Emacs/CLI | emacs.org      | Appended                                            |


#+BEGIN_SRC emacs-lisp

  (setq org-capture-templates
        (quote (
                ;; Moleskine
                ("m" "Moleskine" entry (file+datetree "~/Dropbox/org/moleskine.org")
                 "* %?\nEntered on %U\n  %i\n  ")

                ;; Meeting
                ("M" "Meeting" entry (file+datetree "~/Dropbox/org/moleskine.org")
                 "* MEETING with %? :MEETING:\n%U" :clock-in t :clock-resume t)

                ;; Research
                ("r" "Reading ([Reading Notes] in research.org)" entry (file+headline "~/Dropbox/org/research.org" "Reading Notes")
                 "* %?\n\nCREATED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n" :empty-lines-before 1)

                ;; Emacs/Command Line
                ("e" "Emacs/CLI" entry (file "~/Dropbox/org/emacs.org" )
                 "* %?\n\nCREATED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n" :empty-lines-before 1)
                 
                )
        )
  )


#+END_SRC

#+RESULTS:
| m | Moleskine | entry | (file+datetree ~/Dropbox/org/moleskine.org) | * %? |

